global_config = {
    "map_grid": ((-5, -5), (5, 5)),  # 地图大小
    "start_position": (0, 0),  # 起始位置
    "Strength": 60,  # 总行动力
    "Strength_move": 1,  # 移动一步消耗的行动力
    "Strength_mining": 2,  # 挖掘一次消耗的行动力

    "gain1": 10,  # 区域1挖掘获得的金币最大值
    "gain2": 15,  # 区域2挖掘获得的金币最大值
    "gain3": 20,  # 区域3挖掘获得的金币最大值
    "gain4": 10,  # 区域4挖掘获得的金币最大值
    "gaind": 8,  # 距离收益的最大值

    "loss1": 10,  # 区域1挖掘损失的金币最大值
    "loss2": 10,  # 区域2挖掘损失的金币最大值
    "loss3": 5,  # 区域3挖掘损失的金币最大值
    "loss4": 5,  # 区域4挖掘损失的金币最大值

    # 定义概率
    "p1": 0.5,  # 区域1的挖掘获得金币的概率
    "q1": 0.25,  # 区域1的挖掘损失金币的概率
    "s1": 0,  # 区域1的挖掘获得行动力的概率

    "p2": 0.6,  # 区域2的挖掘获得金币的概率
    "q2": 0.25,  # 区域2的挖掘损失金币的概率
    "s2": 0.1,  # 区域2的挖掘获得行动力的概率

    "p3": 0.6,  # 区域3的挖掘获得金币的概率
    "q3": 0.1,  # 区域3的挖掘损失金币的概率
    "s3": 0.3,  # 区域3的挖掘获得行动力的概率

    "p4": 0.6,  # 区域4的挖掘获得金币的概率
    "q4": 0.25,  # 区域4的挖掘损失金币的概率
    "s4": 0.1,  # 区域4的挖掘获得行动力的概率

    "pd": 0.75,  # 距离收益的概率
    "strength_gain": 5,  # 挖掘获得的行动力
    "start_coins": 30,  # 开始有30块钱
}